Revit 2026 API

# EdgeArrayArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public EdgeArrayArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
EdgeArrayArrayIterator()
```
```fsharp
new : unit -> EdgeArrayArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

EdgeArrayArrayIterator Class

Autodesk.Revit.DB Namespace